[
	{
		"id": "867008",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Payments",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eAs the leading provider of subscription service, the Netflix Payments Platform enables efficient, low-friction, high-approval-rate monthly transactions for over 167M global customers. This platform helps improve long-term revenue for Netflix by optimizing payment processing by continuous innovation and relentless experimentation.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eIn the role of Senior Software Engineer focusing on the Payments Platform, you will take an active role in leading and fostering innovation in the payment industry. You will be responsible for scaling the platform for the next 167M customers and beyond, innovating and implementing critical security defenses and architecting the system for high availability in a very fragmented global payment ecosystem.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eYou belong in this team if:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are a hands-on engineer and you love what you do\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou enjoy working with globally distributed, loosely coupled systems in the cloud\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou have a strong interest in resolving technical challenges related to international online payment processing\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou are self-driven and highly motivated to deliver top-tier solutions with minimal guidance\u003c/li\u003e\u003cli\u003eYou are able to adapt quickly to changes in business requirements and work in an agile environment\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou strongly believe in test-driven development\u003c/li\u003e\u003cli\u003eYou are curious about emerging technologies and can quickly evaluate and adapt to new technologies\u003c/li\u003e\u003cli\u003eYou are team player who is happy to collaborate with the engineering organization across Netflix\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eTechnical qualifications:\u003c/h2\u003e\u003cul\u003e\u003cli\u003e5+ years of server-side software development experience\u003c/li\u003e\u003cli\u003e5+ years of experience in object-oriented programming, preferably in (but not restricted to) Java\u003c/li\u003e\u003cli\u003eSolid expertise in building highly scalable, distributed, loosely coupled systems\u003c/li\u003e\u003cli\u003eDeep knowledge of concurrency, resiliency, and caching\u003c/li\u003e\u003cli\u003eBS/MS in computer science or equivalent\u003c/li\u003e\u003cli\u003eExcellent communication skills\u003c/li\u003e\u003cli\u003eNoSQL experience (Cassandra, MongoDB)\u003c/li\u003e\u003cli\u003eKnowledge of cloud computing platforms (AWS, Microsoft Azure, OpenStack, Google Compute or App Engine, Hadoop, etc.)\u003c/li\u003e\u003cli\u003eExperience working with payment processors and processor integrations\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eBonus if you have experience with: \u003c/h2\u003e\u003cul\u003e\u003cli\u003ekey security concepts such as cryptography, authentication, authorization, security protocols\u003c/li\u003e\u003cli\u003ecybersecurity and payments domain\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb style=\"font-size: inherit\"\u003eA few more things about us:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eAs an organization, we come from many different countries and our educational background is a range from the humanities to engineering to computer science and many more. Folks have the opportunity to wear different hats, should they choose to. We strongly believe this diversity has helped us build an inclusive and empathetic environment, and are looking forward to adding your perspective to the mix!\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe are remote inclusive and our culture is unique. We live by our values. Please read more about the Netflix culture\u0026nbsp;\u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003ehere\u003c/a\u003e.\u0026nbsp;\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:33",
		"url": "https://jobs.netflix.com/jobs/867008"
	},
	{
		"id": "14380448",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Video \u0026 Image Encoding",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eAs the world’s leading internet entertainment service, video and images are crucial to us. Our video streams account for one third of peak download traffic in North America, and are watched by more than 180+ million subscribers worldwide. The images and video clips in our UI help our members find the shows and movies they love.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eWe are responsible for encoding our video streams at the best quality possible, no matter what the content, viewing device or network condition. As we scale, we are transforming our encoding pipeline to meet the needs of other areas of our business -- studio, social, marketing and personalization -- by re-architecting it to a microservices-based architecture with heavily decoupled components and CI/CD-based deployment. In order to enrich the team’s understanding in this area, we are searching for a Senior Software Engineer who will help drive our system’s evolution, and will serve as the de-facto expert on all things micro-services for media processing.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eWe are looking for a self-driven Senior Software Engineer who thrives in a fast-paced environment. You have excellent software development skills and constantly strive to improve yourself and the team. You are eager to apply your expertise in solving cutting-edge video and image processing challenges, impacting what millions of people see everyday.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eAs a Senior Software Engineer for Encoding Services, you will:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eArchitect and develop software for video and image encoding services; designing for quality, robustness and scale\u003c/li\u003e\u003cli\u003eDesign APIs and partner with other teams to build integrations\u0026nbsp;\u003c/li\u003e\u003cli\u003eWork closely with video algorithm experts to implement and optimize code for video analysis, processing and encoding \u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eMinimum Qualifications:\u003c/h2\u003e\u003cul\u003e\u003cli\u003e3+ years experience in software development, with excellent debugging and problem solving skills.\u003c/li\u003e\u003cli\u003eBS in Computer Science/Electrical Engineering or equivalent\u003c/li\u003e\u003cli\u003eExpert in Java or C++ and object-oriented programming\u0026nbsp;\u003c/li\u003e\u003cli\u003eExperience in building large-scale distributed services\u003c/li\u003e\u003cli\u003eKnowledge of image and video processing, or willingness and aptitude to learn\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eBonus points:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience with databases\u003c/li\u003e\u003cli\u003eInvolvement in open-source multimedia projects (such as ffmpeg, x264, webm)\u003c/li\u003e\u003cli\u003eExperience with video codecs such as H.264/AVC, HEVC and VP9\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eTo learn more about our team, check out the following articles:\u003c/h2\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://netflixtechblog.com/improving-our-video-encodes-for-legacy-devices-2b6b56eec5c9\" class=\"postings-link\"\u003ehttps://netflixtechblog.com/improving-our-video-encodes-for-legacy-devices-2b6b56eec5c9\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://netflixtechblog.com/avif-for-next-generation-image-coding-b1d75675fe4\" class=\"postings-link\"\u003ehttps://netflixtechblog.com/avif-for-next-generation-image-coding-b1d75675fe4\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://netflixtechblog.com/vmaf-the-journey-continues-44b51ee9ed12\" class=\"postings-link\"\u003ehttps://netflixtechblog.com/vmaf-the-journey-continues-44b51ee9ed12\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://netflixtechblog.com/optimized-shot-based-encodes-now-streaming-4b9464204830\" class=\"postings-link\"\u003ehttps://netflixtechblog.com/optimized-shot-based-encodes-now-streaming-4b9464204830\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://netflixtechblog.com/per-title-encode-optimization-7e99442b62a2\" class=\"postings-link\"\u003ehttps://netflixtechblog.com/per-title-encode-optimization-7e99442b62a2\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://netflixtechblog.com/high-quality-video-encoding-at-scale-d159db052746\" class=\"postings-link\"\u003ehttps://netflixtechblog.com/high-quality-video-encoding-at-scale-d159db052746\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:28",
		"url": "https://jobs.netflix.com/jobs/14380448"
	},
	{
		"id": "42687603",
		"company": "NETFLIX",
		"title": "Senior Software Engineer, Personalization Data",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eAbout the Team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eWith nearly 200 million members in over 190 countries and a billion hours of streaming each month, Netflix is the world’s leading online entertainment company. Netflix continues to shape the future of entertainment by developing personalized ways for members to discover and enjoy a rapidly growing catalog of movie and TV content.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe personalization data engineering team is responsible for building large, web-scale datasets used for personalizing the Netflix experience. These datasets serve as inputs to the advanced machine learning systems that drive our product innovation. All of this is done by leveraging Big Data infrastructure like Spark, Flink, Kafka, Cassandra, Presto etc to build data pipelines, frameworks, and services.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout the role\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eGiven the size, complexity and criticality of our datasets, we are looking for a Software Engineer\u0026nbsp; with a deep analytical mindset and experience with modern distributed systems. As a member of this team, you will drive innovation in big data processing by contributing and adding to the team’s suite of data products and frameworks. You will also have the unique opportunity to partner with our world-class algorithm teams to drive continuous improvement to Netflix personalization via A/B tests.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eSkills required for this role:\u003c/h2\u003e\u003cul\u003e\u003cli\u003e5+ years of experience building production data pipelines (using Spark, Flink, etc.) on web-scale datasets.\u003c/li\u003e\u003cli\u003eProficiency in at least one major programming language (e.g. Java, Scala) and ability pick up new tech skills independently.\u003c/li\u003e\u003cli\u003eHands on experience with schema design and data modeling, with an unmistakable passion for elegant and intuitive dataset design.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eQualities we value:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou have a passion for engineering excellence and tolerance for ambiguity in a fast-paced setting.\u003c/li\u003e\u003cli\u003eYou are independent and can allocate your time judiciously. You employ organizational context to resolve competing priorities.\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou are able to strategically partner with diverse stakeholders to drive innovation.\u003c/li\u003e\u003cli\u003eYou seek to drive change and influence others through clear and effective communication.\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eOur culture:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eYou can learn more about Netflix’s unique \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eculture\u003c/a\u003e of Freedom and Responsibility, that presents an opportunity to work with some of the best and the brightest, allowing you to make a difference to our business in a meaningful way.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:16",
		"url": "https://jobs.netflix.com/jobs/42687603"
	},
	{
		"id": "41464626",
		"company": "NETFLIX",
		"title": "Senior Software Engineer, Productivity Engineering",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eAbout Netflix:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with over 195 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout the team:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eProductivity Engineering is the organization tasked with making Netflix engineers more effective by building and supporting the infrastructure to create, build, test, deploy, run and monitor the Netflix stack. As Netflix continues to grow, so does the complexity behind our engineering systems. Our challenge is deceivingly simple: keep the developer experience amazing even as complexity grows. Our work impacts virtually every developer at Netflix and enables other platform teams to innovate at a faster pace.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eIn this job, you will:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Learn about the ins and outs of the Netflix developer ecosystem\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Work to \u003ca href=\"https://landing.google.com/sre/workbook/chapters/eliminating-toil/\" class=\"postings-link\"\u003ereduce toil\u003c/a\u003e using abstractions that unlock value for language platforms\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Pave the path away from large microservices and into composable and managed components\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Provide polished building blocks that work great out of the box but are open to extension\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Use your knowledge and leadership skills to influence other developers and advocate for best practices\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eOn our radar:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e• Building a local/hybrid Kubernetes-like experience\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Enabling platform teams to build, deploy, test, and manage infra \u003ca href=\"https://docs.microsoft.com/en-us/azure/architecture/patterns/sidecar\" class=\"postings-link\"\u003esidecars\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Automating dependency management\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Reimagining the build graph in a cloud-first world\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Improving testability across the board\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Driving towards a serverless future\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWhile we use and support many different platforms and languages, our team primarily uses Golang and Node for our tooling. Experience with these, along with the container ecosystem, cloud infrastructure, build systems, and CI/CD tools will help you be successful at this job. US-based remote is ok!\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eIf this sounds interesting, we’d love to talk to you!\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eNetflix Culture\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eTo learn more about Netflix culture, see \u003ca href=\"http://jobs.netflix.com/culture\" class=\"postings-link\"\u003ejobs.netflix.com/culture\u003c/a\u003e. We are excited to discuss with you how it applies to our team, and how Netflix values permeate our approach to work.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:16",
		"url": "https://jobs.netflix.com/jobs/41464626"
	},
	{
		"id": "39441923",
		"company": "NETFLIX",
		"title": "Senior Software Engineer, Experimentation Platform",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is reinventing the way the world watches movies and television. Over 150 million members around the globe already enjoy our award-winning content, but most of our growth still lies ahead. Growth on a global scale requires us to constantly experiment with new ideas across all aspects of the Netflix product -- UI, recommendations, search algorithms, sign-up flows, messaging, video streaming algorithms and more.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eThe Experimentation Platform team builds internal tools with a big impact across the company. We are currently reimagining and rebuilding our experiment configuration capabilities. These new systems come with new use cases and new users. You will help us build out the next generation of experimentation and feature flag infrastructure at Netflix. We have a particular emphasis on providing high quality, reliable operational visibility into new feature rollouts. Ideal candidates will be excited by the idea of partnering with nearly every product engineering team, deeply understanding their use cases and building an exceptional product for them.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003ePeople who do well on this team are self-motivated engineers with a passion for building robust systems and working closely with technical partners from a variety of backgrounds. We are looking for a person with experience building reliable high scale, low latency systems.\u0026nbsp; We also value people who are passionate about operational visibility and building tooling that supports other teams performing safe, reliable test roll outs. We currently work with Java and are beginning to dabble in Kotlin -- the ability to adapt to changing technology is an important strength.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eOur team includes people of all genders, sexual orientation, parents, childless chameleon moms, the self-taught, the university-educated, and people of a wide variety of nationalities, ages, and socio-economic backgrounds. Diverse teams are strong teams, and we encourage those with varied identities, backgrounds, and experiences to apply.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eOpportunities to Make an Impact\u003c/h2\u003e\u003cul\u003e\u003cli\u003eDesign and build the systems responsible for assigning our members into A/B tests.\u0026nbsp;\u003c/li\u003e\u003cli\u003eBuild the next generation of infrastructure that is the foundation for adaptive experimentation -- multi armed bandits, and Bayesian Optimization for example.\u003c/li\u003e\u003cli\u003eEnable products across Netflix by providing a simple and robust feature flag system.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhat Sets You Apart\u003c/h2\u003e\u003cul\u003e\u003cli\u003eIndependent, proactive, and able to deliver high quality code with minimal guidance.\u003c/li\u003e\u003cli\u003eProven expertise in building and operating scalable distributed services for real-world use cases\u003c/li\u003e\u003cli\u003ePassion for operational excellence -- both across Netflix and in this team’s systems.\u003c/li\u003e\u003cli\u003eGreat communication and collaboration skills. You will work with a wide swath of engineers who build different parts of our product.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhy Netflix?\u003c/h2\u003e\u003cul\u003e\u003cli\u003eWe’re bringing unique stories from around the world to a global audience at a scale never done before\u003c/li\u003e\u003cli\u003eYou’ll work with other senior, high-performing engineers so you will be constantly learning and sharpening your skillset\u003c/li\u003e\u003cli\u003eWe pay top of market with excellent benefits\u003c/li\u003e\u003cli\u003eOur \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eculture\u003c/a\u003e is something we strive to constantly improve and practice daily\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eRemote Work\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eWe are open to hiring for this role remotely, within the US. Don't let the Los Gatos location hold you back if you are interested in this role.\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:20",
		"url": "https://jobs.netflix.com/jobs/39441923"
	},
	{
		"id": "38183679",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Customer Trust",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eAs a global company, Netflix’s customers come from diverse backgrounds. And each of these backgrounds allow them to experience joy from Netflix in their own unique way. Ultimately, this joy is rooted in our customers’ ability to trust Netflix. At Netflix, we earn this trust through our actions every day. And we work hard to continue to build this trust with our customers throughout the world.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe Customer Trust team at Netflix is a central security team that sets a broad strategic vision in the trust space. We execute on that vision through both technical work on the team and cross-functional partnerships, addressing problems related to account takeover, service abuse, customer targeted scams, DDoS and more. We are looking for a software engineer to build and operate production quality systems at Netflix scale for detection and prevention across the fraud landscape.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe person in this role will own, build and advance our fraud protection services at Netflix. In collaboration with other team members, you will be responsible for designing and developing new features in our service to enhance our posture, test our resiliency and ensure we are protected against large scale attacks. You will combat at-scale fraud schemes, such as credential stuffing and brute force attacks and you will also be the point of contact for other Netflix engineering teams who need to integrate with our services.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eDesired skills and background:\u003c/h2\u003e\u003cul\u003e\u003cli\u003ePassionate about protecting our customers\u003c/li\u003e\u003cli\u003eAbility to collaborate effectively within and across teams\u003c/li\u003e\u003cli\u003eAbility to define and execute short and long term technical goals\u0026nbsp;\u003c/li\u003e\u003cli\u003eExperience developing software and building services and automation at scale\u0026nbsp;\u003c/li\u003e\u003cli\u003eExperience with Java\u003c/li\u003e\u003cli\u003eExperience with designing and deploying security products is preferred.\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003eWe are looking for thoughtful professionals who enable our mission and support our culture of freedom and responsibility.\u0026nbsp; You can learn more about \u003ca href=\"https://jobs.netflix.com/\" class=\"postings-link\"\u003elife at Netflix\u003c/a\u003e by watching our \u003ca href=\"https://www.youtube.com/c/NetflixSecurity\" class=\"postings-link\"\u003esecurity talks\u003c/a\u003e or exploring our \u003ca href=\"https://netflix.github.io/\" class=\"postings-link\"\u003eopen source work\u003c/a\u003e.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eNetflix culture\u003c/a\u003e permeates our work environment. It determines who we hire, how we work together, and how we make decisions. It encourages us to bring our best every day while valuing collaboration over individual achievement.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:20",
		"url": "https://jobs.netflix.com/jobs/38183679"
	},
	{
		"id": "26743139",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - TV UI",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eThe Explore team crafts UI experiments to find the \u003c/span\u003e\u003ca href=\"https://variety.com/2019/digital/news/netflix-latest-upcoming-titles-section-tv-app-1203306950/\" style=\"font-size: 11pt\" class=\"postings-link\"\u003ebest experience\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e to connect people with \u003c/span\u003e\u003ca href=\"https://techcrunch.com/2020/02/24/new-netflix-feature-reveals-the-top-10-most-popular-programs-on-its-service/\" style=\"font-size: 11pt\" class=\"postings-link\"\u003estories they'll love\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e. Join our team of product-minded engineers and be part of the TV revolution. Your work will delight millions of customers worldwide on hundreds of different TV devices, from game consoles to smart TVs to cable boxes.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhat’s Different About Us\u003c/h2\u003e\u003cul\u003e\u003cli\u003eWe validate our judgment by \u003ca href=\"https://hbr.org/2020/03/productive-innovation#avoid-the-pitfalls-of-a-b-testing\" class=\"postings-link\"\u003eA/B testing\u003c/a\u003e product variants with real customers\u003c/li\u003e\u003cli\u003eOur team develops TV applications, not websites or mobile apps\u003c/li\u003e\u003cli\u003eYour work will have direct and measurable impact on the business\u003c/li\u003e\u003cli\u003eAlmost all of your code will be JavaScript and TypeScript, building on top of our purpose-built TV platform\u003c/li\u003e\u003cli\u003eWe pay top of market. We work to attract the best and brightest, and pay accordingly\u003c/li\u003e\u003cli\u003eOur \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eculture\u003c/a\u003e is unique, and we live by our values, so it’s worth learning more about us at \u003ca href=\"https://jobs.netflix.com\" class=\"postings-link\"\u003ejobs.netflix.com\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eEvery Day\u003c/h2\u003e\u003cul\u003e\u003cli\u003eBuild new UI on the leading TV app that pushes the boundaries of what’s possible on \u003ca href=\"http://techblog.netflix.com/2017/01/crafting-high-performance-tv-user.html\" class=\"postings-link\"\u003eperformance and memory constrained devices\u003c/a\u003e\u003c/li\u003e\u003cli\u003ePartner with designers and product managers to define and refine concepts that will shape the future of entertainment on TV-connected devices\u003c/li\u003e\u003cli\u003eCollaborate with our device platform and backend service teams to create functionality to support your projects\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:24",
		"url": "https://jobs.netflix.com/jobs/26743139"
	},
	{
		"id": "25490602",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Demand Engineering",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eBuilding a very reliable service like Netflix requires that hundreds of services work together reliably. If that doesn’t happen we’ve failed at our jobs. The Demand Engineering team's focus is reliability. We achieve reliability by ensuring capacity needs are met across the Netflix ecosystem. We do this by shaping traffic, scaling systems and recovering from failure.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eDemand Engineering helps Netflix meet our customer reliability and overall efficiency goals by ensuring that the services that run Netflix have the compute resources they need where and when they need them to. We run the infrastructure to reactively mitigate incidents through regional evacuation without our customers noticing.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eOur team sits in the middle of the action at Netflix. In order to serve over 193m members around the world Netflix needs to have capacity available when and where it’s needed. More importantly we need to be able to shift that capacity on a moment's notice in the event of a problem with the infrastructure. This means predicting what compute resources are needed, when they’re needed and where they’re needed at any point in the day.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eOur team creates the tools and techniques needed to make this all possible in addition to operating the infrastructure. Steering and scaling are powerful tools to influence the availability and latency of Netflix during normal operations as well.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eWe have a lot of fun problems to solve, a scale that makes them challenging, and a culture that gives us the freedom to pursue what is best for our members and the business.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWho you are\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are intensely curious about how systems operate and fail at scale\u003c/li\u003e\u003cli\u003eYou reflect on design choices and trade-offs you have made\u003c/li\u003e\u003cli\u003eYou insightfully draw connections between minutiae of implementation details and emergent system behavior\u003c/li\u003e\u003cli\u003eYou think freely and independently, and are ready to share your view\u003c/li\u003e\u003cli\u003eYou are humble and eager to learn from mistakes and you socialize the lessons learned\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhat you’ll do\u003c/h2\u003e\u003cul\u003e\u003cli\u003eTake ownership of cross functional projects that impact the majority of the Netflix fleet.\u003c/li\u003e\u003cli\u003eCreate new solutions and see them through, from conception to production\u003c/li\u003e\u003cli\u003eWrite code to support our existing solutions, most of which are in Python\u003c/li\u003e\u003cli\u003eRespond to problems in production in real-time while on-call\u003c/li\u003e\u003cli\u003ePerform regional evacuation\u003c/li\u003e\u003cli\u003eUse data analysis to improve our capacity and failover predictions\u003c/li\u003e\u003cli\u003eShape the future of capacity management and efficiency by abstracting complexity for other engineering teams\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eRequirements\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou have built or contributed to a variety of systems, ideally in different technologies\u003c/li\u003e\u003cli\u003eExperience with microservice architectures and/or the nitty-gritty of low-level concurrency concerns\u003c/li\u003e\u003cli\u003eSome experience with large scale data analytics and familiarity with data science tools.\u003c/li\u003e\u003cli\u003eStrong software design and development skills in modern dynamic programming languages\u003c/li\u003e\u003cli\u003eWillingness to be part of an on-call rotation for regional evacuation\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eNice to have\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience with multi-site high availability\u003c/li\u003e\u003cli\u003eExperience with dynamic scaling (AWS)\u003c/li\u003e\u003cli\u003eExperience with internet-scale infrastructure\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eInterested to learn more?\u003c/h2\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.linkedin.com/pulse/what-demand-engineering-aaron-blohowiak/\" class=\"postings-link\"\u003eWhat is Demand Engineering?\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://medium.com/netflix-techblog/project-nimble-region-evacuation-reimagined-d0d0568254d4\" class=\"postings-link\"\u003eProject Nimble\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://medium.com/netflix-techblog/evolving-regional-evacuation-69e6cc1d24c6\" class=\"postings-link\"\u003eEvolving Regional Evacuation\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eOur Culture\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.linkedin.com/pulse/interviewing-demand-engineering-netflix-aaron-blohowiak/\" class=\"postings-link\"\u003eHow will our team interview you?\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:28",
		"url": "https://jobs.netflix.com/jobs/25490602"
	},
	{
		"id": "11722456",
		"company": "NETFLIX",
		"title": "Senior Software Engineer, Product Notifications",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with over 167 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eThe Team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eThe Messaging Engineering team at Netflix creates \u0026amp; delivers multi-channel messaging experiences for customers and partners in the Netflix Product and Studio ecosystems. The team owns the platform, applications, channels, and messages that enables Netflix to communicate with its customers and partners.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe are an experimentation focussed product development team. We experiment on outbound messaging channels such as Email, Push, Messaging Apps, and the browser to name a few. The team also owns in-product notifications on all \u003ca href=\"https://devices.netflix.com/en/\" class=\"postings-link\"\u003eNetflix devices\u003c/a\u003e. We experiment on messaging experiences in the Notification Center and elsewhere within the product.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eYou can read more details on some of the work the team has done on the \u003ca href=\"https://sites.google.com/netflix.com/messaging\" class=\"postings-link\"\u003eMessaging Engineering @ Netflix \u003c/a\u003esite.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eThe Role\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eAs a Senior Software Engineer in Product on the Messaging Team, you will be responsible for innovation of the Netflix Product through notifications using in-app and outbound messaging channels. You will implement experiments, build features, deploy systems, and be responsible for the end-to-end execution of projects.\u0026nbsp; You will partner with stakeholders from product management, design, data science, consumer insights, and engineering from teams across many functions at Netflix. You will collaborate with UI engineers who work on the Netflix app on Android, iOS, Website, and TV. You will work with engineers on a variety of backend services from core membership services such as billing, payments, accounts, to content focused services such as artwork, metadata, and personalization.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eRequired Skills\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience in developing consumer facing applications through experimentation techniques like A/B Testing\u003c/li\u003e\u003cli\u003eExperience in building highly scalable fault tolerant distributed systems in cloud-based architectures (AWS, Azure, GCP)\u003c/li\u003e\u003cli\u003eSolid experience in Java and other object oriented languages\u003c/li\u003e\u003cli\u003eExperience writing SQL queries on big data platforms (SparkSQL, Presto, Hive, etc)\u003c/li\u003e\u003cli\u003eExperience with designing intuitive and extensible APIs for multiple external clients\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eNice To Have Skills\u003c/h2\u003e\u003cul\u003e\u003cli\u003ePrevious experience in building large-scale, highly resilient gRPC services\u003c/li\u003e\u003cli\u003eDevelopment experience with Spring and SpringBoot\u003c/li\u003e\u003cli\u003ePrior experience in mobile server and client development on Android or iOS\u003c/li\u003e\u003cli\u003eExperience building backend systems to power frontend experiences\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eAbout You\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are diligent, thoughtful, and articulate. You have great oral and written communication skills and can communicate with both technical and non-technical audiences\u003c/li\u003e\u003cli\u003eYou can work across all phases of the \u003ca href=\"https://netflixtechblog.com/full-cycle-developers-at-netflix-a08c31f83249\" class=\"postings-link\"\u003esoftware development lifecycle\u003c/a\u003e (planning, design, implementation, testing, deployment, operations and support)\u003c/li\u003e\u003cli\u003eYou can make wise choices and take smart risks when dealing with ambiguous requirements. Once you have context, you can figure out how to solve problems on your own.\u003c/li\u003e\u003cli\u003eYou are proactive and can move fast or pivot to meet the changing needs of the product\u003c/li\u003e\u003cli\u003eYou enjoy problem solving and can use everything from big-data to\u0026nbsp; command line tools to help you identify and fix issues\u003c/li\u003e\u003cli\u003eYou are passionate about product development and you enjoy the independence of managing projects on your own\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003eWe are remote inclusive and our culture is unique. We tend to live by our values, so it’s worth learning more about Netflix \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003ehere\u003c/a\u003e.\u0026nbsp;Apply to talk to us to see if this product development role on a small, impactful, and collaborative team is right for you.\u0026nbsp;\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:31",
		"url": "https://jobs.netflix.com/jobs/11722456"
	},
	{
		"id": "872011",
		"company": "NETFLIX",
		"title": "Senior Software Engineer (Japanese Speaking)",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eThe Company and Product Strategy:\u0026nbsp;\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eInstant streaming is a core part of Netflix's strategy for the future. Our first product to support instant streaming to TVs was launched in May 2008 and has since expanded to all relevant connected screens in the home, including TV’s, streaming sticks, and operator set-top boxes. Our reach and ease-of-use is enhanced through strong partnerships with many of the world's most innovative partners such as Sony, Panasonic, J:COM, and KDDI. In this role, you will help ensure we continue our strong innovation and partnership with our biggest partners in Japan.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout the role:\u0026nbsp;\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eIn order to help our partners add the Netflix instant streaming service quickly to their device, we work very closely with these engineering teams to quickly overcome any and all challenges. We are looking to add to our team in APAC that currently works with local partners on integration, certification and in field phases of a product. You’ll apply your experience in software development to a wide variety of technical challenges to achieve the goal of helping our Japanese partners bring their products to market on time with the highest quality. The functionality of our platform includes streaming and playback, dynamic UI, payments, security and partner-specific adaptation for new types of devices. Willingness to travel to Netflix’s Los Gatos, CA headquarters to interface with the internal engineering teams, as well as periodic travel to Japan to develop and maintain strong ties with our partners.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eOur culture is a bit unique, and we tend to live by our values, so it’s worth learning more about Netflix at \u003ca href=\"https://jobs.netflix.com/life-at-netflix\" class=\"postings-link\"\u003ehttps://jobs.netflix.com/life-at-netflix\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eRequired skills and attributes: \u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are fluent in Japanese with excellent business reading and intermediate business writing skills. You should also have intermediate spoken and written English skills.\u003c/li\u003e\u003cli\u003eYou are an experienced and current C/C++ programmer.\u003c/li\u003e\u003cli\u003e5+ years of relevant experience integrating applications into complex embedded platforms.\u003c/li\u003e\u003cli\u003eYou know what's important when releasing software to partners – ideally, you have worked as a software developer producing as well as consuming an SDK (Software Development Kit).\u003c/li\u003e\u003cli\u003eYou're comfortable with proactive outward communication and technical leadership.\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou enjoy working side by side with partners on tough and ambiguous problems. Experience working with partners is a plus.\u003c/li\u003e\u003cli\u003eIdeally, you have a deep background in one or more of the following: embedded system development, Linux system-level programming, audio/video playback, embedded graphics, or UI programming.\u0026nbsp;\u003c/li\u003e\u003cli\u003eExperience with Android application and Android framework development is a plus.\u003c/li\u003e\u003cli\u003e2-3 years experience as a team leader or an engineering manager is a plus.\u003c/li\u003e\u003cli\u003ePeriodic travel to Los Gatos, California and regional offices required\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Hsinchu City, Taiwan",
		"date": "2020-12-14 18:05:31",
		"url": "https://jobs.netflix.com/jobs/872011"
	},
	{
		"id": "40388840",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Workflows \u0026 Foundations (Delivery Engineering)",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eThe Delivery Engineering team at Netflix is building \u003c/span\u003e\u003ca href=\"https://www.spinnaker.io/\" style=\"font-size: 11pt\" class=\"postings-link\"\u003eSpinnaker\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e, our Continuous Delivery platform, which facilitates Netflix in delivering billions of hours of movies and TV shows per month to over 195 million paid memberships.\u0026nbsp; The ability to rapidly and confidently deploy the code that directly affects the Netflix experience is a huge competitive advantage. Whether it's an internal tool, a new recommendation algorithm, or changing the UI to showcase Stranger Things, teams across Netflix rely on Delivery Engineering's Continuous Delivery platform to make it happen.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eWe are looking for senior software engineers to join our Delivery Engineering team. We’re eager to talk to you if you’re passionate about building software that enables developers to use the cloud more effectively, enables developers to deploy code to production, and accelerates developer productivity.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhat you will do:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eWork on \u003ca href=\"https://www.spinnaker.io/\" class=\"postings-link\"\u003eSpinnaker\u003c/a\u003e, Netflix’s Continuous Delivery platform.\u003c/li\u003e\u003cli\u003eHelp us evolve our continuous delivery platform by building new features and support for our internal teams at Netflix as well as our Open Source community.\u003c/li\u003e\u003cli\u003eCoordinate and scale the build and cloud deployment systems across all product development teams at Netflix.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eThe skills we require:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eGreat communication skills, both verbal and written.\u003c/li\u003e\u003cli\u003eRelevant software engineering experience (working on distributed architectures).\u003c/li\u003e\u003cli\u003eExperience with Java or other JVM languages.\u003c/li\u003e\u003cli\u003eA curious mind with a bias towards learning.\u003c/li\u003e\u003cli\u003eExperience and comfort with modern relational and non-relational databases.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eThe skills we prefer:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience with AWS, Google Cloud, Microsoft Azure, or similar cloud environments.\u003c/li\u003e\u003cli\u003eExperience building and managing automated build/test/deployment environments.\u003c/li\u003e\u003cli\u003eFamiliarity with languages like Groovy, Kotlin, or Python.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:20",
		"url": "https://jobs.netflix.com/jobs/40388840"
	},
	{
		"id": "33413593",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Studio UI Developer Productivity",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eAbout The Netflix Studio Product Team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eNetflix is now producing hundreds of Original TV shows and movies which are enjoyed by millions of our members all over the world. The Studio Product organization exists to enable an innovative, technology-powered Studio for global planning, production, promotion, and delivery of content at scale. By bringing our technology expertise to the entertainment industry and reimagining the way a script goes from \"pitch to play\", we plan to make an even bigger impact to movies and television by \u003c/span\u003e\u003ca href=\"https://jobs.netflix.com/podcast/season/3/episode/5\" style=\"font-size: 11pt\" class=\"postings-link\"\u003ebuilding the world’s most technologically advanced studio\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout The Studio UI Developer Productivity Team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eThe Studio UI Developer Productivity team’s mission is to enable UI engineers working in the Studio space to develop, deliver and operate their applications efficiently and with confidence. Our unique challenge is supporting engineers working on a very broad and heterogeneous set of product domains - from financial projections, to on set production, to content marketing, and more. We are a small team and we collaborate with several platform and infrastructure teams across the company to identify points of leverage and build \u003c/span\u003e\u003ca href=\"https://www.slideshare.net/diannemarsh/the-paved-road-at-netflix\" style=\"font-size: 11pt\" class=\"postings-link\"\u003epaved-road\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e solutions for an organization of 100+ UI engineers.\u0026nbsp; One example of a project we are currently working on is a Functions-as-a-Service platform to relieve UI engineers from having to deploy and maintain \u003c/span\u003e\u003ca href=\"http://Node.js\" style=\"font-size: 11pt\" class=\"postings-link\"\u003eNode.js\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e servers for their applications.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout The Role\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eWe are looking for a Senior Software Engineer to drive innovation in the software development life cycle. You will excel at this role if you are passionate about developer velocity, empathetic to developer pain points, pragmatic in solving technical problems, curious and eager to learn new technologies and how to apply them to solve common development lifecycle problems. We have a unique \u003c/span\u003e\u003ca href=\"https://jobs.netflix.com/culture\" style=\"font-size: 11pt\" class=\"postings-link\"\u003eculture\u003c/a\u003e\u003cspan style=\"font-size: 11pt\"\u003e that will allow you to do your best work and grow. For this role we expect you to demonstrate expertise in the following areas:\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Leading cross team initiatives, and collaborating with contributors from various domains\u003c/div\u003e\u003cdiv\u003e• Systems architecture, preferably around large scale CI/CD systems\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Server-side languages and application platforms (e.g. \u003ca href=\"http://Node.js\" class=\"postings-link\"\u003eNode.js\u003c/a\u003e, Ruby on Rails, Java, Go)\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Cloud computing platforms (e.g. AWS, Azure, GCP)\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Linux systems and shell scripting\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAlso nice to have, but not required, is expertise in:\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Frontend development and frameworks\u003c/div\u003e\u003cdiv\u003e•\u0026nbsp;Frontend testing frameworks\u0026nbsp;\u0026nbsp;\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:20",
		"url": "https://jobs.netflix.com/jobs/33413593"
	},
	{
		"id": "35866118",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Search \u0026 Engagement Platform",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eAbout the Team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with nearly 200 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause, and resume watching, all without commercials or commitments.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe Search \u0026amp; Engagement team builds backend systems that help millions of members globally find and discover content they’ll love via Search, Voice UI, and other interactive experiences in the Netflix product.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout the role\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eWe are looking for a Senior Software Engineer to design, code and lead projects to enhance our newly developed page serving capabilities. Your work will directly impact innovation velocity for multiple areas on the Netflix product such as Search, Post Play, and new page experiences. You will partner closely with the algorithm, infrastructure, and UI teams to define and evolve our serving stack and provide leadership on cross-functional projects. You will contribute to broader architecture discussions to shape how Netflix makes the systems even more resilient, flexible, and scalable to support new use cases, technologies, and increasingly more traffic.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eQualifications\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience building Large-Scale Distributed Systems\u003c/li\u003e\u003cli\u003eExperience in both SOA and Microservices architectures\u003c/li\u003e\u003cli\u003eExpertise in concurrent programming and data structures\u003c/li\u003e\u003cli\u003eStrong principles towards writing clean, simple, maintainable code\u003c/li\u003e\u003cli\u003eExperience leading cross-functional projects\u003c/li\u003e\u003cli\u003eStrong verbal and written communication\u003c/li\u003e\u003cli\u003eBS and/or MS in Computer Science or related field\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eBonus points for any of the following\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience with GraphQL, gRPC, AWS, Docker or other container technologies\u003c/li\u003e\u003cli\u003eStrong Java skills and knowledge\u003c/li\u003e\u003cli\u003eExperience in API design and delivery\u003c/li\u003e\u003cli\u003eExperience building consumer facing products\u003c/li\u003e\u003cli\u003eExperience with A/B testing\u003c/li\u003e\u003cli\u003eFull-stack experience\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:24",
		"url": "https://jobs.netflix.com/jobs/35866118"
	},
	{
		"id": "871998",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Developer Productivity, TVUI",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with 183 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe TVUI team builds the industry-leading Netflix TV app. We work with our design and product partners to rapidly experiment with\u003ca href=\"https://media.netflix.com/en/company-blog/see-whats-popular-on-netflix\" class=\"postings-link\"\u003e new product ideas\u003c/a\u003e. We scale the app to work beautifully across hundreds of different devices, from powerful game consoles, to streaming sticks, and everything in between.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe’re looking for a Senior Software Engineer to drive innovations in the frameworks, integrations and automation space that will enable the engineering teams to build, test, and operate the Netflix app that runs on TVs. This role has a high impact on the productivity and performance of the engineering teams. You will excel if you are curious, contribute broadly, and can drive scalable technical solutions that mesh with our business goals. We have a unique \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eculture\u003c/a\u003e that allows you to do your best work and grow.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cspan style=\"font-size: 11pt\"\u003eLocation of work: Remote. We value what you can do, from anywhere in the United States.\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhat We’ll Expect From You\u003c/h2\u003e\u003cul\u003e\u003cli\u003eOwn and drive key initiatives that support the developer workflow from PR to release\u003c/li\u003e\u003cli\u003eProvide integrations to improve and simplify large-scale testing efforts\u003c/li\u003e\u003cli\u003eInnovate, and deliver great technical solutions\u003c/li\u003e\u003cli\u003eWork collaboratively with the partner engineering teams in gathering inputs, and providing support and guidance\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWhat To Expect From Netflix\u003c/h2\u003e\u003cul\u003e\u003cli\u003eMeaningful work: Your team directly enables and accelerates innovation of the premier app for streaming\u003c/li\u003e\u003cli\u003eImpact: You will help shape the future of an industry\u003c/li\u003e\u003cli\u003eFreedom \u0026amp; Responsibility: Our roles are not circumscribed, so we have the freedom to use our judgment to make Netflix better without permission\u003c/li\u003e\u003cli\u003eInclusive: We embrace different backgrounds, perspectives, and styles because it helps us make better decisions\u003c/li\u003e\u003cli\u003eStunning colleagues: Work with amazing talent\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:28",
		"url": "https://jobs.netflix.com/jobs/871998"
	},
	{
		"id": "869644",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Show Workflows Team",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is one of the largest studios in the world. Netflix empowers storytellers from all over the globe to tell the stories you fall in love with. Producing content globally, at this scale is a unique challenge; this is where our team comes in. We help free up creative resources to focus on what’s meaningful: producing amazing \u0026amp; entertaining content.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eOur team builds backend services for production workflows on set. The services we build power applications (\u003ca href=\"https://play.google.com/store/apps/details?id=com.prodicle.aprodicle\" class=\"postings-link\"\u003eAndroid\u003c/a\u003e, \u003ca href=\"https://apps.apple.com/us/app/prodicle/id1446977765\" class=\"postings-link\"\u003eiOS\u003c/a\u003e and Web) that production cast and crew use daily throughout the entire process of producing content for Netflix. Some examples of workflows we support today are quick onboarding of users (cast \u0026amp; crew), contact management, secure document sharing, etc.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eDo you want to help Netflix content creators tell amazing stories? Are you an experienced Software Engineer who loves building backend systems? Join us, and help disrupt the film industry and bring joy to millions of viewers around the globe.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eYou’ll want to work with us if you:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExcel in developing distributed systems with high availability, fault tolerance \u0026amp; low latency\u0026nbsp;\u003c/li\u003e\u003cli\u003eProactively seek out problems and resolve independently\u0026nbsp;\u003c/li\u003e\u003cli\u003eTake calculated risks, recognize when you're wrong, learn from your mistakes, and move past them\u003c/li\u003e\u003cli\u003eLove brainstorming with our partners (Engineering teams, Product and Design) and users to understand underlying business needs and come up with robust solutions\u003c/li\u003e\u003cli\u003eDevelop software incrementally and take full responsibility for the quality of your code and end-to-end testing\u003c/li\u003e\u003cli\u003eAim to embrace best practices and are always searching for opportunities to learn \u0026amp; improve\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWe would love to work with you if:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are an expert Java programmer who is up-to-date with the evolution of Java (at least up to Java 8)\u003c/li\u003e\u003cli\u003eYou understand the challenges of distributed systems and are comfortable building APIs leveraging any of the following technologies REST, gRPC, or GraphQL\u003c/li\u003e\u003cli\u003eYou have experience with relational or NoSQL data stores, such as PostgreSQL, Redis, or Cassandra\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eBonus Points:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience with working in Spring Boot\u003c/li\u003e\u003cli\u003eExperience working with Amazon Web Services\u0026nbsp;\u003c/li\u003e\u003cli\u003eExperience building asynchronous workflows\u003c/li\u003e\u003cli\u003eGraphQL experience\u003c/li\u003e\u003cli\u003eMulti-region deployment experience\u003c/li\u003e\u003cli\u003eComfortable evangelizing ideas and output\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Angeles, California",
		"date": "2020-12-14 18:05:33",
		"url": "https://jobs.netflix.com/jobs/869644"
	},
	{
		"id": "34623514",
		"company": "NETFLIX",
		"title": "Senior Software Engineer, Content Acquisition Engineering",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with\u003cb\u003e over 195\u003c/b\u003e million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout our team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe content acquisition process begins with a submission for a show or movie, which is reviewed by teams tasked with evaluating submissions. Our tools enable them to merge data science with human intuition, enabling ever more informed decisions. When a show is approved, we guide our users through the complex world of negotiations to secure the rights to produce and distribute this new content. As we get closer to production, we provide our users the ability to discover and assemble the right people and vendors to actually produce the show, ranging from acting talent and directors to facility rentals and VFX.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eIf you’re an experienced Software Engineer who loves building backend systems, is interested in utilizing technology to revolutionize entertainment, and wants an opportunity to collaborate with and learn from folks throughout Netflix, we’d love to meet you.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eYou may enjoy working with us if you:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eAre self-driven and highly motivated to deliver top-tier solutions with minimal guidance. You also recognize when you're wrong, learning from your mistakes and moving past them.\u003c/li\u003e\u003cli\u003eLove brainstorming with fellow backend and UI engineers, product designers, product managers, and our users, to understand what they want, figure out what they really need, and finally, what we should build.\u003c/li\u003e\u003cli\u003eStrive to embrace best practices and are always searching for opportunities to continually improve.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWe would love to work with you if:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are an experienced Java programmer who is up to date with the evolution of Java and its ecosystem of frameworks and build tools.\u003c/li\u003e\u003cli\u003eExcel in developing microservice based distributed systems with high availability, throughput, fault tolerance, and performance.\u003c/li\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eOur culture is unique, and we tend to live by our values, so it’s worth learning more about Netflix at \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003ehttps://jobs.netflix.com/culture\u003c/a\u003e\u003c/div\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e",
		"location": "Remote, United States",
		"date": "2020-12-14 18:05:24",
		"url": "https://jobs.netflix.com/jobs/34623514"
	},
	{
		"id": "35866119",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Search \u0026 Voice Systems",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eAbout the Team\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with nearly 200 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause, and resume watching, all without commercials or commitments.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe Search \u0026amp; Voice Systems team creates the product experience for members searching for titles on all devices, whether they speak or type their query in the search box. We develop the systems that parse and understand member queries and run models to fetch, organize, and rank the search results. Our problem space is increasingly challenging and ripe for innovation as the business scales to support more languages and further personalize the member experience.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eAbout the role\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eWe are looking for a Senior Software Engineer to design, code and lead innovation projects to improve the Search product experience and Voice experiences in partnership with Alexa, Google Assistant, and other Netflix partners. You will join an experienced, high performing\u0026nbsp; team of engineers actively working in this problem space. You will partner closely with the product management, applied research, data science / engineering, infrastructure, and UI teams and provide leadership on cross-functional projects. You will work with the team to drive technical direction and make our Search and Voice systems even more resilient, flexible, and scalable to support new use cases, more traffic, and host increasingly more complex machine learned models.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eQualifications\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience leading cross-functional projects\u003c/li\u003e\u003cli\u003eExperience building large-scale distributed systems\u003c/li\u003e\u003cli\u003eExperience in both SOA and Microservices architectures\u003c/li\u003e\u003cli\u003eExpertise in concurrent programming and data structures\u003c/li\u003e\u003cli\u003eStrong verbal and written communication\u003c/li\u003e\u003cli\u003eBS and/or MS in Computer Science or related field\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eBonus points for any of the following\u003c/h2\u003e\u003cul\u003e\u003cli\u003eSearch, NLU, NLP, and/or Voice domain experience\u003c/li\u003e\u003cli\u003eSolr / Lucene, Elastic Search, or other Search technologies\u003c/li\u003e\u003cli\u003eCloud-based architectures (AWS, Azure, GCP)\u003c/li\u003e\u003cli\u003eStrong Java, Scala skills and knowledge\u003c/li\u003e\u003cli\u003eExperience with A/B Testing\u003c/li\u003e\u003cli\u003eExposure to Machine Learning\u003c/li\u003e\u003cli\u003eAds, recommendations, and/or personalization experience\u003c/li\u003e\u003cli\u003eApache Spark or other distributed compute frameworks\u0026nbsp;\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:31",
		"url": "https://jobs.netflix.com/jobs/35866119"
	},
	{
		"id": "35859279",
		"company": "NETFLIX",
		"title": "Director, Security Services Engineering",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003e\u003cb\u003eThe Opportunity\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eNetflix is the world’s leading streaming entertainment service with over 190 million paid memberships in over 190 countries. This is made possible, in part, by an engineering organization that enables our customers to stream content and our studio to produce content. The Security Services Engineering organization supports these engineers at Netflix by creating and operating authentication, authorization, and cryptographic software services. The teams in this organization operate at the intersection of software engineering, privacy, and security expertise.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe are looking for a Director of Engineering to lead the Security Services Engineering organization. You will set the vision and strategy for this organization and work closely with your teams and the broader business to ensure that we stay aligned and moving in the right direction. And you will mentor people in your organization to enable both personal and organizational growth along the various dimensions of \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eNetflix’s values\u003c/a\u003e.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eThe Role\u003c/h2\u003e\u003cul\u003e\u003cli\u003eGuide the Security Services Engineering organization to manage risk by creating security products that address business needs and are simple to use.\u003c/li\u003e\u003cli\u003eMentor and grow a world class team of engineering managers and security software engineers.\u003c/li\u003e\u003cli\u003eCollaborate closely with security, product, and engineering teams throughout Netflix.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eYour Background\u003c/h2\u003e\u003cul\u003e\u003cli\u003eAn inclusive and empathetic leader\u003c/li\u003e\u003cli\u003eStrong written and verbal communication skills\u003c/li\u003e\u003cli\u003eStrong collaboration across teams with different backgrounds and skill sets\u003c/li\u003e\u003cli\u003eExperience leading a team of engineering managers\u003c/li\u003e\u003cli\u003eExperience working with software (either as a software engineer or as a manager of software engineering teams)\u003c/li\u003e\u003cli\u003eExperience with computer security and risk management\u003c/li\u003e\u003cli\u003eAbility to craft and socialize a vision for a security software organization\u003c/li\u003e\u003cli\u003eIf you are remote to Los Gatos, CA (and not interested in moving to the San Francisco Bay Area): willing to work pacific time zone hours and experience leading remote teams\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003eThe teams in our Security Services Engineering organization have often shared our work with the broader security community. We encourage you to learn more about us by reading about our open source projects (\u003ca href=\"https://github.com/Netflix/lemur\" class=\"postings-link\"\u003eLemur\u003c/a\u003e for certificate management) and conference talks (\u003ca href=\"https://www.youtube.com/watch?v=15H5uCj1hlE\" class=\"postings-link\"\u003eSecrets at Scale\u003c/a\u003e talk at USENIX Enigma and \u003ca href=\"https://www.youtube.com/watch?v=Xxo9GZYl0lM\" class=\"postings-link\"\u003eBuilding Identity for an Open Perimeter\u003c/a\u003e talk at the RSA Conference).\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe \u003ca href=\"https://jobs.netflix.com/culture\" class=\"postings-link\"\u003eNetflix culture\u003c/a\u003e permeates our work environment. It determines who we hire, how we work together, and how we make decisions. It encourages us to bring our best every day while valuing collaboration over individual achievement. If this sounds exciting to you, we encourage you to apply today so that we can learn more about each other.\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:24",
		"url": "https://jobs.netflix.com/jobs/35859279"
	},
	{
		"id": "24162194",
		"company": "NETFLIX",
		"title": "Senior Software Engineer, Personalization Application Core",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with 193 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across various genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. At Netflix, we use personalization to recommend great titles to our users.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003ePersonalization Application Core team focuses on building high leverage systems and components to drive innovation in the personalization space. Our team is responsible for developing all the building blocks required to run the personalization at scale. Some of those building blocks are ML-based title rankers, user services (My List, Ratings, Interaction Store, etc.), content experience \u0026amp; configuration, personalization health validation systems, and many more.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eGiven this is a central focus for our business, you will play a highly cross-functional role partnering with other engineers, product management, machine learning, and data teams to take Netflix's personalization to the next level. We are looking for a strong backend engineer who has an excellent track record in building large scale distributed systems.\u0026nbsp;\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eIf you have a passion for building scalable, robust systems; are interested in pushing the envelope in applying discovery and recommendation algorithms; operate in a critical part of the stack that strongly influences what our customers see on their screens; love working with the latest technologies in a fast-paced, agile environment; and are excited at the prospect of having a significant impact on software that over 193 million people use and love, then we want to talk to you.\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eWho you are\u003c/h2\u003e\u003cul\u003e\u003cli\u003eYou are curious about discovering new and better ways to solve problems.\u003c/li\u003e\u003cli\u003eYou aim for broad, optimal solutions while solving the practical task at hand.\u003c/li\u003e\u003cli\u003eYou seek to make your team and the product you work on better as you go.\u003c/li\u003e\u003cli\u003eYou are willing to take broad ownership of team responsibilities.\u003c/li\u003e\u003cli\u003eYou are excited to work in a multidisciplinary environment (engineering, algorithms, data engineering/science, product experimentation).\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eRequirements\u003c/h2\u003e\u003cul\u003e\u003cli\u003e8+ years of software engineering experience with a proven track record of delivering quality results\u003c/li\u003e\u003cli\u003eStrong software architecture \u0026amp; design skills\u003c/li\u003e\u003cli\u003eStrong coding skills, preferably in Java\u003c/li\u003e\u003cli\u003eExperience with large-scale distributed systems\u003c/li\u003e\u003cli\u003eExperience with public cloud like AWS, Azure or GCP\u003c/li\u003e\u003cli\u003eExperience working with ML or ML teams\u003c/li\u003e\u003cli\u003eStrong verbal and written communication skills\u003c/li\u003e\u003cli\u003eBS/MS in computer science (or equivalent)\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eNice to have\u003c/h2\u003e\u003cul\u003e\u003cli\u003eExperience with content discovery, personalization\u003c/li\u003e\u003cli\u003eExperience with A/B testing\u003c/li\u003e\u003cli\u003eExperience with big data\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:28",
		"url": "https://jobs.netflix.com/jobs/24162194"
	},
	{
		"id": "867243",
		"company": "NETFLIX",
		"title": "Senior Software Engineer - Media Cloud Engineering",
		"category": "SOFTWARE",
		"description": "\u003cdiv\u003eNetflix is the world's leading streaming entertainment service with over 195 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe Media Cloud Engineering provides highly available infrastructure for content production and processing across all Netflix productions and licensed content. Infrastructure pieces like massive scale media processing platforms (\u003ca href=\"https://netflixtechblog.com/simplifying-media-innovation-at-netflix-with-archer-3f8cbb0e2bcb\" class=\"postings-link\"\u003e1\u003c/a\u003e, \u003ca href=\"https://netflixtechblog.com/high-quality-video-encoding-at-scale-d159db052746\" class=\"postings-link\"\u003e2\u003c/a\u003e), workflows (\u003ca href=\"https://github.com/Netflix/conductor\" class=\"postings-link\"\u003econductor\u003c/a\u003e), media asset management, collaboration, reporting, \u003ca href=\"https://netflixtechblog.com/delta-a-data-synchronization-and-enrichment-platform-e82c36a79aee\" class=\"postings-link\"\u003edata processing \u003c/a\u003eare some of the key services we build. All this is custom built on top of Amazon Web Services (AWS) infrastructure. We are looking for a senior distributed software engineer to help us build and grow Media Cloud Engineering.\u0026nbsp; In this role you will have the opportunity to apply your skills to develop robust and scalable software.\u0026nbsp; We provide the freedom to execute, learn and pivot, and the responsibility to be self directed, collaborative and insightful.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eYou will be successful in this role if you:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eAre a quick learner and excited about learning new technologies\u003c/li\u003e\u003cli\u003ePassionate about automated testing, code quality and engineering best practices\u003c/li\u003e\u003cli\u003eAdvocate software craftsmanship and take pride in your work\u003c/li\u003e\u003cli\u003eThrive in an environment with lots of context and minimal guidance\u003c/li\u003e\u003cli\u003eEnjoy collaborating with engineers across functional teams and have excellent communication skills\u003c/li\u003e\u003cli\u003eEnjoy taking full ownership of projects from conception to production\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eQualifications:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eHave 5+ years of experience with languages like Java, C++, Ruby, or Kotlin, and have proficiency in OO design principles\u003c/li\u003e\u003cli\u003eFamiliarity with microservices using Java or or similar languages, using either of RESTful API, gRPC or GraphQL\u003c/li\u003e\u003cli\u003eHave a good understanding of concepts like concurrency, parallelism, event driven architecture\u003c/li\u003e\u003cli\u003eExperience in designing and developing large scale distributed systems\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eNice to have:\u003c/h2\u003e\u003cul\u003e\u003cli\u003eMS/BS in Computer Science or a related degree\u003c/li\u003e\u003cli\u003eExperience with Cloud Computing platforms: Amazon AWS, Microsoft Azure, Google App Engine or similar\u003c/li\u003e\u003cli\u003eExperience with technologies like Spring, NoSQL (e.g. Cassandra, Redis, CockroachDB), Kafka, Elasticsearch\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003eIf you’d like, please share with us some additional information about yourself (e.g. your race, ethnicity, sexual orientation, gender identity, and disability information). It’s completely voluntary. This information will be used to help us know more about people who interview with us and ensure representation in who we consider in our efforts to provide an equal opportunity to everyone who wants to work at Netflix. And for more information about what we collect and how we use it, please refer to the Candidate Privacy Statement.\u003c/div\u003e",
		"location": "Los Gatos, California",
		"date": "2020-12-14 18:05:31",
		"url": "https://jobs.netflix.com/jobs/867243"
	}
]